CSI API ETABS v1

# e2DFrameType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum e2DFrameType

    Public Enumeration e2DFrameType

    Dim instance As e2DFrameType

    public enum class e2DFrameType

    type e2DFrameType

Members

| Member name| Value| Description
---|---|---|---
| PortalFrame| 0|
| ConcentricBraced| 1|
| EccentricBraced| 2|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com